# WELCOME TO THE NOTEBOOK
---
### Agenda:

#### Task 1: what is Lambda expression?
#### Task 2: Lambda expressions and lists
    - what is map function?
    - map function and lambda
#### Task 3: Lambda expressions combined if else statement 
    - what is filter function ?
#### Task 4: Lambda expressions and sorting 
    - sorting a list of tuples using Lambda 
    - sorting a list of dictionaries using Lambda
#### Task 5: Data Manipulation and Exploration using Lambda Expressions

### Task 1: What is Lambda Expression ?

- Let's define a python function:  get two numerical variables as an input, and calculate the multiplication of two values and return it.

In [1]:
def mul(a,b):
    r=a*b;
    return r
mul(9,9)

81

- let's define a lambda expression with the same purpose

<img src="images/lambdaa.png" >

In [3]:
mul_l=lambda a,b:a*b

- let's check the variable type

In [5]:
mul_l

- let's call the lambda

In [4]:
mul_l(9,9)

81

- example : define a lambda function: gets a value and return square of the value

In [8]:
sqr_lambda=lambda x:x**2
sqr_lambda(5)

25

- example : define lambda function: gets three values and return a list containing those values

In [9]:
to_list=lambda x,y,z:[x,y,z]
to_list(5,6,7)

[5, 6, 7]

- example : define lambda function : gets a string and return the first character of the string

In [10]:
first=lambda str:str[0]
first("nope")

'n'

- Exercise : define a lambda function: gets a string and return the length of it

In [11]:
lngth=lambda str:len(str)
lngth("nope")

4

### Task 2: Lambda Functions and Lists

- let's define a normal function: get's a list, return a list of all values to the power of 2

In [13]:
numbers = [1,2,3,10,9,3,4,10,7]

In [16]:
def list_sqr(list_):
    newlist=[]
    for element in list_:
        newlist.append(element**2)
    return newlist
list_sqr(numbers)

[1, 4, 9, 100, 81, 9, 16, 100, 49]

- let's use map function

In [19]:
def func(element):
    return element**2
list(map(func,numbers))

[1, 4, 9, 100, 81, 9, 16, 100, 49]

- map function and lambda

In [20]:
sqr_lambda=lambda x:x**2
list(map(sqr_lambda,numbers))

[1, 4, 9, 100, 81, 9, 16, 100, 49]

- let's make it even more compact

In [21]:
list(map(lambda element:element**2,numbers))

[1, 4, 9, 100, 81, 9, 16, 100, 49]

- example: I have a list of words, let's use map function to convert all the words into upper case.

In [25]:
words = ["football","python","java","coffee","keyboard"]

In [26]:
list(map(lambda element:element.upper(),words))

['FOOTBALL', 'PYTHON', 'JAVA', 'COFFEE', 'KEYBOARD']

- Exercise : we have a list of sentences, use map function and lambda to convert all the sentences into lower case.

In [27]:
sentences = [
    "Today is Thursday and weather Is Sunny.",
    "Tomorrow at 14 PM, Meeting with Daniel.",
    "Python is a powerfull Tool For DataScience.",
    "Tommy Called Today, He told me He does not feel Good... I think It's COVID!"
]

In [29]:
list(map(lambda element:element.lower(),sentences))

['today is thursday and weather is sunny.',
 'tomorrow at 14 pm, meeting with daniel.',
 'python is a powerfull tool for datascience.',
 "tommy called today, he told me he does not feel good... i think it's covid!"]

### Task 3 : Lambda Expression combined with if statement

- let's define a normal function: gets a value and return true of the value is even, return false if the value is odd

In [31]:
def isEven(value):
    if(value%2==0):
        return 1
    else:
        return 0
isEven(2)

1

- let's define a lambda with same purpose

In [34]:
is_even_lambda=lambda value: 1 if value%2==0 else 0
is_even_lambda(8)

1

- consider a list of numbers, define a normal function : gets a list of numbers and create a new list that contains only the even numbers from our input list

In [35]:
numbers = [1,2,3,10,9,3,4,10,7]

- let's use filter function

In [37]:
def func(element):
    if element%2==0:
        return True;
    else:
        return False;
list(filter(func,numbers))

[2, 10, 4, 10]

In [38]:
is_even_lambda=lambda value: 1 if value%2==0 else 0

list(filter(is_even_lambda,numbers))

[2, 10, 4, 10]

- example: I have a list of names, let's use filter function and lambda to filter out the names starting with 'A'

In [40]:
names = ["John","Alex","Maiki","Alice","Layla","Hanna","Alexander","Anil","Angela","Lola","Thelma","Clara"]

In [41]:
is_even_lambda=lambda value: 1 if value[0]=='A' else 0
list(filter(is_even_lambda,names))

['Alex', 'Alice', 'Alexander', 'Anil', 'Angela']

- example: use filter and lambda function to filter out the names that starts with an 'A' and with the length of 4

In [43]:
is_even_lambda=lambda value: 1 if value[0]=='A' and len(value)==4 else 0
list(filter(is_even_lambda,names))

['Alex', 'Anil']

- exercise: we have a list of numbers, use map function and lambda to multiply the odd values by 10 and the even values by 100 in our numbers list

In [6]:
numbers = [1,2,3,10,9,3,4,10,7]

In [ ]:
# do here

### Task 4: Lambda expressions and sorting

#### Sorting a list of tuples 
- Let's say we have a list of products with their respective prices, stored as a tupple in a list.

In [53]:
products = [
    ("Cheese",1.50),
    ("Banana Bread",2.10),
    ("Chicken Meat",3.50),
    ("Apple Juice",0.45),
    ("Orange Juice",1.25),
    ("Milk",0.75),
    ("Mango",1.25)
]

In [54]:
products

[('Cheese', 1.5),
 ('Banana Bread', 2.1),
 ('Chicken Meat', 3.5),
 ('Apple Juice', 0.45),
 ('Orange Juice', 1.25),
 ('Milk', 0.75),
 ('Mango', 1.25)]

- Let's sort the list based on the prices

In [60]:
products.sort(key=lambda element:element[1])

#### Sorting a list of dictionaries 
- Let's say we have a list of 7 person with their information (name, age, Income) stored in a dictionary.

In [61]:
persons = [
    {"Name" : "Jake" , "Age" : 23 , "Income"  : 450 },
    {"Name" : "Maria" , "Age"  : 32 , "Income"  : 2550 },
    {"Name" : "Will" , "Age"  : 43 , "Income"  : 4500 },
    {"Name" : "Layla" , "Age"  : 12 , "Income"  : 0 },
    {"Name" : "Mina" , "Age"  : 35 , "Income"  : 2100 },
    {"Name" : "Lola" , "Age"  : 28 , "Income"  : 450 },
    {"Name" : "Thelma" , "Age"  : 23 , "Income"  : 450 },
]

- sort the list based on each person's age

In [64]:
persons.sort(key=lambda person:person['Age'])
persons

[{'Name': 'Layla', 'Age': 12, 'Income': 0},
 {'Name': 'Jake', 'Age': 23, 'Income': 450},
 {'Name': 'Thelma', 'Age': 23, 'Income': 450},
 {'Name': 'Lola', 'Age': 28, 'Income': 450},
 {'Name': 'Maria', 'Age': 32, 'Income': 2550},
 {'Name': 'Mina', 'Age': 35, 'Income': 2100},
 {'Name': 'Will', 'Age': 43, 'Income': 4500}]

- Exercise: sort the list based on each person's income

In [65]:
persons.sort(key=lambda person:person['Income'])
persons

[{'Name': 'Layla', 'Age': 12, 'Income': 0},
 {'Name': 'Jake', 'Age': 23, 'Income': 450},
 {'Name': 'Thelma', 'Age': 23, 'Income': 450},
 {'Name': 'Lola', 'Age': 28, 'Income': 450},
 {'Name': 'Mina', 'Age': 35, 'Income': 2100},
 {'Name': 'Maria', 'Age': 32, 'Income': 2550},
 {'Name': 'Will', 'Age': 43, 'Income': 4500}]

### Task 5: Data Manipulation and Exploration using Lambda Expressions
- we have dataframe containing of information related to 11 Employees who are working in a technology company

In [68]:
import pandas as pd 
df = pd.DataFrame({
    'Name':['Jeremy','Frank','Janet','Ryan','Mary',"John","Alex","Maiki","Alice","Layla","Hanna"],
    'Hourly Wage' : [6,7,22,10,32,10,29,10,12,10,30],
    'Type of contract' : ["Part-Time","Part-Time","Full-Time","Part-Time",
                          "Full-Time","Part-Time","Full-Time","Part-Time",
                          "Part-Time","Part-Time","Full-Time"]
})
df

      Name  Hourly Wage Type of contract
0   Jeremy            6        Part-Time
1    Frank            7        Part-Time
2    Janet           22        Full-Time
3     Ryan           10        Part-Time
4     Mary           32        Full-Time
5     John           10        Part-Time
6     Alex           29        Full-Time
7    Maiki           10        Part-Time
8    Alice           12        Part-Time
9    Layla           10        Part-Time
10   Hanna           30        Full-Time

- let's add a column "Daily Working Hours", containing of number of hours each employee works in a day, based on their contract type. 
#### Assume that  : 
    - part-time job working hours : 20 hours per week (4 hours per day)
    - full-time job working hours : 40 hours per week (8 hours per day)

In [70]:
df['Daily Working Hours']=df['Type of contract'].apply(lambda e:4 if e=='Part-Time' else 8)

In [71]:
df

      Name  Hourly Wage Type of contract  Daily Working Hours
0   Jeremy            6        Part-Time                    4
1    Frank            7        Part-Time                    4
2    Janet           22        Full-Time                    8
3     Ryan           10        Part-Time                    4
4     Mary           32        Full-Time                    8
5     John           10        Part-Time                    4
6     Alex           29        Full-Time                    8
7    Maiki           10        Part-Time                    4
8    Alice           12        Part-Time                    4
9    Layla           10        Part-Time                    4
10   Hanna           30        Full-Time                    8

- Let's add a column "Annual Income", calculate Annual income of each employee

In [74]:
df["Total_wage"]=df.apply(lambda row: row["Daily Working Hours"]* row["Hourly Wage"]*365,axis=1)

In [75]:
df

      Name  Hourly Wage Type of contract  Daily Working Hours  Total_wage
0   Jeremy            6        Part-Time                    4        8760
1    Frank            7        Part-Time                    4       10220
2    Janet           22        Full-Time                    8       64240
3     Ryan           10        Part-Time                    4       14600
4     Mary           32        Full-Time                    8       93440
5     John           10        Part-Time                    4       14600
6     Alex           29        Full-Time                    8       84680
7    Maiki           10        Part-Time                    4       14600
8    Alice           12        Part-Time                    4       17520
9    Layla           10        Part-Time                    4       14600
10   Hanna           30        Full-Time                    8       87600

- Exercise: Add a column "Annual Tax Amount", for each person calculate how much tax they pay each a year based on the annual income
#### Personal income tax rates  :
    - if the annual income is more than 64000, the tax rate would be 35%
    - if the annual income is less than 64000, the tax rate would be 0%

In [ ]:
# do here